Revit 2027 API
BuiltInFailures.EditingFailures.OutOfDateElements Property
 Workset is editable, but you must Reload Latest before editing the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OutOfDateElements { get; }
Public Shared ReadOnly Property OutOfDateElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OutOfDateElements {
	FailureDefinitionId^ get ();
}
static member OutOfDateElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace